<?php
namespace Error;
/**
 * 错误码设置类
 */
class CodeConfigModel {
    /**
     * 获取错误码配置
     */
    public static function getCodeConfig() {
        return array(
            "0" => "success",
            "1" => "缺少token",
            "2" => "验签失败",
            "3" => "缺少参数",
            "4"=> "请求方式错误",
            "101" => "缺少手机号请求参数",
            "102" => "手机号有误",
            "103" => "验证码错误",
            "104" => "验证码过期",
            "105" => "邀请码不存在",
            "106" => "手机号已经存在，请直接登录",
            "107" => "账号密码错误",
            "108" => "缺少密码",
            "109" => "缺少认证等级",
            "110" => "缺少国籍",
            "111" => "缺少姓名",
            "112" => "缺少证件类型",
            "113" => "缺少份证号",
            "114" => "缺少正面照",
            "115" => "缺少反面照",
            "116" => "缺少手持照",
            "117" => "缺少账单类型",
            "200" => "缺少用户ID",
            "201" => "缺少用户头像",
            "202" => "缺少交易密码",
            "203" => "缺少旧交易密码",
            "204" => "旧交易密码错误",
            "205" => "缺少反馈星星",
            "206" => "缺少反馈内容",
            "207" => "交易密码错误",
            "208" => "缺少市场价格",
            "209" => "缺少保证金",
            "210" => "缺少手续费",
            "211" => "缺少倍数",
            "212" => "缺少手数",
            "213" => "缺少合约类型",
            "300" => "缺少币种",
            "301" => "缺少划转类型",
            "302" => "缺少币币数量",
            "303" => "缺少出仓",
            "304" => "缺少进仓",
            "305" => "缺少钱包地址",
            "306" => "缺少投票状态",
            "307" => "缺少period参数",
            "308" => "交易金额必须在交易限额范围内",
            "309" => "你还有借币未归还,请先归还",
            "310" => "借币数量不在范围内",
            "311" => "你无借币，无须还币",
            "312" => "请先归还借币",
            "313" => "缺少address_id参数",
            "400" => "缺少活动ID",
            "500" => "系统繁忙请稍后再试",
            "501" => "支付失败",
            "502" => "余额不足",
            "503" => "支付方式错误",
        );
    }
}